{"meta":{"title":"PandaFeng","subtitle":"","description":"","author":"John Doe","url":"http://example.com","root":"/"},"pages":[],"posts":[{"title":"我的第一篇博客","slug":"myFirstHexo","date":"2021-04-10T08:27:06.830Z","updated":"2021-04-10T09:01:30.681Z","comments":true,"path":"2021/04/10/myFirstHexo/","link":"","permalink":"http://example.com/2021/04/10/myFirstHexo/","excerpt":"","text":"欢迎来到我的博客，我是一名前端工程师渣渣，因为自小身体健硕，加上上学工作很少锻炼，所以我自称为“冯胖胖”，大家也可以叫我“PandaFeng”。 创建博客的目的首先从我的工作说起我现在在一家生产交换机的企业，运维项目组担任一名前端程序员，每天的工作，就是维护公司中监控系统使用的前端框架。为什么说是维护呢？因为在这儿我除了面对框架，没有别的项目进行，这个监控系统不是采用的前后端分离的形式，所有的页面都是有各个页面接口人自己完成，而他们页面中使用的组件就是我目前维护的这个框架产出的。而我就是应对各个页面业务组件的需求，要么在现有的前端组件基础上添加新的功能，要么就是自己重新编写一个新的组件来满足需求。在这差不多两年的时间，之前的那些拿手的东西，也忘得差不多了，我想要充实自己，但是只看不操作，发现自己真的记不住。。。 其次说下来自外界的压力我毕业于石家庄的一所二流大学。毕业文凭也是二本。之前的自己在高考结束之后，对于二本本身没有太感冒，想着这是我自己的事情，我的人生不想需要重新来过。对于父母以及亲戚想让我复读的想法，我是不屑一顾的，最后家里拧不过我，只能是从了我的意愿。其实现在来说我是有点后悔的，现在的公司对于学历的要求似乎更加的一致，整体呈上升的趋势。先不说技术层面的原因，单单是在你找工作投简历的时候，你就会发现一些好的职位，都有明确的学历要求，最然说一些职位也会放宽社招学历要求，但是你看到之后，难免自己心理就已经有点打退堂鼓了，面对这样一个招聘的机会，首先气势就会减弱。在面试进行中的时候，也会因为学历而整个面试都变得比较艰难吧。好的学历真的能让你的面试变得简单并且好学校真的会让面试你的人对你的印象比较好，虽然说可能你的“真实的技术确实不怎么样”。（我现在项目组中就有明显的例子，新任入职之前，被项目经理吹上了天，技术怎么怎么样，懂得多少多少，实际呢，带新人的那个同事会时不时的想我们吐槽，这就是xxx经理吹上天的人？就这，一个部署环境，搞一天都搞不定，一个问题定位一天定位不到，要么就是定位出来不知道怎么解决。。。）再有就是最近我同学们（我宿舍和兄弟宿舍一共12人的群），从去年春节之前就一直在讨论换工作，薪资的问题，是不是就会传来xxx面试xxx公司，拿到了多少多少的offer，虽然挺体他们高兴的，但是回头看看自己的工资条，只能默默的探口气。（我也想出去面试，可是想想自己现在的水平，太难了。。。） 最后再说说来自生活的压力我现在眼瞅着就奔三了，仍然是单身狗一枚。结婚的事家里也着急，我自己也着急，但是很无奈，以现在目前的状况，即使有对象，我是没有勇气去结婚的（更不用说现在丈母娘的要求了），欲哭无泪。 所以基于以上的几点，我觉得自己应该在把之前的东西捡起来的同时，在提高高自己，争取找到一份满意的工作哈，早日圆了家里老父亲老母亲的爷爷奶奶梦。。。","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2021-04-10T08:00:33.246Z","updated":"2021-04-10T08:00:33.246Z","comments":true,"path":"2021/04/10/hello-world/","link":"","permalink":"http://example.com/2021/04/10/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[]}